{
    "locales": {
        "en": {
            "title": "Welcome!",
            "title_menu": "About me",
            "title_long_prefix": "Hello...",
            "title_long": "I'm **Mohana Krishna Alla!**"
        },

        "es": {
            "title": "¡Saludos!",
            "title_menu": "Sobre mí",
            "title_long_prefix": "Hola...",
            "title_long": "Soy **Mohana Krishna Alla!**"
        },

        "te": {
            "title": "స్వాగతం!",
            "title_menu": "నా గురించి",
            "title_long_prefix": "హలో...",
            "title_long": "నేను **మోహన కృష్ణ అల్లా!**"
        },

        "hi": {
            "title": "स्वागत है!",
            "title_menu": "मेरे बारे में",
            "title_long_prefix": "नमस्ते...",
            "title_long": "मैं **मोहन कृष्ण अला!** हूँ"
        },

        "sa": {
            "title": "स्वागतम्!",
            "title_menu": "मम विषये",
            "title_long_prefix": "नमः...",
            "title_long": "अहं **मोहन कृष्ण आलः!**"
        }
    },

    "articles": [
        {
            "id": "contact_list",
            "component": "ArticleGrid",
            "config": {
                "ignorePaddingTop": true,
                "format": "inline"
            },
            "locales": {
                "en": {},
                "es": {},
                "te": {},
                "hi": {},
                "sa": {}
            },

            "items": [
                {
                    "value": "Dallas – Texas",
                    "links": [
                        {"href": null}
                    ],
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-city",
                        "faColors": {"bg": null, "fill": null}
                    }
                },
                {
                    "value": "mohanakrishna.alla07@gmail.com",
                    "links": [
                        {"href": "mailto:mohanakrishna.alla07@gmail.com"}
                    ],
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-envelope",
                        "faColors": {"bg": null, "fill": null}
                    }
                },
                {
                    "value": "@amkc777",
                    "links": [
                        {"href": "https://github.com/amkc777"}
                    ],
                    "icon": {
                        "img": null,
                        "fa": "fa-brands fa-github",
                        "faColors": {"bg": null, "fill": null}
                    }
                }
            ]
        },

        {
            "id": "short_description",
            "component": "ArticleInfoBlock",
            "config": {},
            "locales": {
                "en": {"title": "**A little bit** about me..."},
                "es": {"title": "**Un poco** sobre mí..."},
                "te": {"title": "**కొంచెం** నా గురించి..."},
                "hi": {"title": "**थोड़ा** मेरे बारे में..."},
                "sa": {"title": "**अल्पं** मम विषये..."}
            },

            "items": [
                {
                    "icon": {
                        "img": "images/svg/logo.svg",
                        "fa": null,
                        "faColors": {"bg": null, "fill": null}
                    },
                    "locales": {
                        "en": {
                            "text": "<p>I am a Data Engineer with <b>over 5 years</b> of experience, specializing in data solutions on Azure, AWS, and Snowflake, along with expertise in Python, SQL, and machine learning. I have a proven track record in fraud detection, data analytics, and optimizing ETL pipelines.</p><p>My technical skills and cloud expertise make me well-equipped to adapt to diverse data project needs and drive impactful solutions.</p><p>I look forward to collaborating <b>with you!</b></p>"
                        },
                        "es": {
                            "text": "<p>Soy un Ingeniero de Datos con <b>más de 5 años</b> de experiencia, especializado en soluciones de datos en Azure, AWS y Snowflake, con experiencia en Python, SQL y aprendizaje automático. Tengo un historial comprobado en detección de fraude, análisis de datos y optimización de pipelines ETL.</p><p>Mis habilidades técnicas y experiencia en la nube me permiten adaptarme a diversas necesidades de proyectos de datos y ofrecer soluciones de impacto.</p><p>¡Espero con interés colaborar <b>contigo!</b></p>"
                        },
                        "te": {
                            "text": "<p>నేను Azure, AWS మరియు Snowflake పై డేటా పరిష్కారాలలో ప్రత్యేకత కలిగిన, Python, SQL మరియు యాంత్రిక అభ్యాసంలో నైపుణ్యంతో <b>5 సంవత్సరాలకు పైగా</b> అనుభవం ఉన్న డేటా ఇంజనీరుగా ఉన్నాను. నేను మోసాలను గుర్తించడం, డేటా విశ్లేషణ మరియు ETL పైప్లైన్లను సమర్థవంతంగా చేసుకోవడం లో నిరూపిత పత్రాలు కలిగిఉన్నాను.</p><p>నా సాంకేతిక నైపుణ్యాలు మరియు క్లౌడ్ నైపుణ్యాలు నావరకు వివిధ డేటా ప్రాజెక్టుల అవసరాలకు అనుగుణంగా ఉండటానికి నాకు అనువుగా తయారుచేసాయి.</p><p>నేను మీతో <b>సహకరించేందుకు ఎదురుచూస్తున్నాను!</b></p>"
                        },
                        "hi": {
                            "text": "<p>मैं एक डेटा इंजीनियर हूं, जिसमें Azure, AWS और Snowflake पर डेटा समाधानों में <b>5 वर्षों से अधिक</b> का अनुभव है, साथ ही Python, SQL और मशीन लर्निंग में विशेषज्ञता है। मेरे पास धोखाधड़ी पहचान, डेटा एनालिटिक्स और ETL पाइपलाइनों को अनुकूलित करने का सिद्ध ट्रैक रिकॉर्ड है।</p><p>मेरे तकनीकी कौशल और क्लाउड विशेषज्ञता मुझे विभिन्न डेटा परियोजना आवश्यकताओं के अनुकूल बनाने में मदद करती है और प्रभावी समाधान प्रदान करती है।</p><p>मैं आपके साथ <b>सहयोग</b> करने की आशा करता हूं!</p>"
                        },
                        "sa": {
                            "text": "<p>अहं Azure, AWS च Snowflake इत्यस्मिन् डेटा समाधानास्मिन् <b>5 वर्षाणां अधिकं</b> अनुभवं धारयामि, Python, SQL च यान्त्रिक अधिगम इत्यस्मिन् विशेषज्ञता च मम अस्ति। अहं fraud detection, data analytics च ETL pipelines च समायोजने च प्रमाणितं कार्यानुभवं धारयामि।</p><p>मम तकनीकी कौशलं च क्लाउड विशेषज्ञता च विविध डेटा प्रकल्पानां आवश्यकतासु अनुकूलनं कर्तुं समर्थः अस्ति च परिणामदायकं समाधानं दातुं योग्यः अस्ति।</p><p>अहं तव सह <b>सहयोगं कर्तुं</b> प्रतीक्षां करोमि!</p>"
                        }
                    }
                }
            ]
        },

        {
            "id": "testimonials",
            "component": "ArticleTestimonials",
            "config": {},
            "locales": {
                "en": {"title": "Client **testimonials**"},
                "es": {"title": "Testimonios de **clientes**"},
                "te": {"title": "**గ్రాహకుల** సాక్ష్యాలు"},
                "hi": {"title": "**ग्राहक** प्रशंसा पत्र"},
                "sa": {"title": "**ग्राहकस्य** प्रमाणपत्राणि"}
            },
            
            "items": [
                    {
                        "value": "Anita Bath",
                        "links": [
                            {"href": "https://linkedin.com"}
                        ],
                        "icon": {
                            "img": "images/pictures/person-1.png",
                            "fa": "fa-solid fa-user",
                            "faColors": null
                        },
                        "locales": {
                            "en": {
                                "info": "CEO at <b>SalesForce</b>",
                                "text": "Working with Mohana was a transformative experience. His programming skills and dedication not only improved our project but also inspired the entire team."
                            },
                            "es": {
                                "info": "CEO en <b>SalesForce</b>",
                                "text": "Trabajar con Mohana fue una experiencia transformadora. Sus habilidades de programación y dedicación no solo mejoraron nuestro proyecto, sino que también inspiraron a todo el equipo."
                            },
                            "te": {
                                "info": "CEO <b>SalesForce</b> వద్ద",
                                "text": "మోహనతో పని చేయడం ఒక మార్పు తీసుకొచ్చే అనుభవం. అతని ప్రోగ్రామింగ్ నైపుణ్యాలు మరియు నిబద్ధత మా ప్రాజెక్టును మెరుగుపరచడం మాత్రమే కాదు, మొత్తం బృందాన్ని కూడా ప్రేరేపించాయి."
                            },
                            "hi": {
                                "info": "<b>SalesForce</b> के सीईओ",
                                "text": "मोहन के साथ काम करना एक परिवर्तनकारी अनुभव था। उनके प्रोग्रामिंग कौशल और समर्पण ने न केवल हमारे प्रोजेक्ट को सुधारा, बल्कि पूरे टीम को भी प्रेरित किया।"
                            },
                            "sa": {
                                "info": "<b>SalesForce</b> यः CEO",
                                "text": "मोहनस्मिन् सह कार्यं कृतं परिवर्तनकारी अनुभवः। तस्य प्रोग्रामिङ्ग कौशलं च न केवलं प्रकल्पं सुधारयति, अपितु सम्पूर्णं कार्यदले च प्रेरणां ददाति।"
                            }
                        }
                    },
                    {
                        "value": "Lou Natic",
                        "links": [
                            {"href": "https://github.com"}
                        ],
                        "icon": {
                            "img": "images/pictures/person-3.png",
                            "fa": null,
                            "faColors": {"bg": null, "fill": null}
                        },
                        "locales": {
                            "en": {
                                "info": "Lead Developer at <b>GitHub</b>",
                                "text": "Having Mohana on our team was an invaluable asset. His deep programming insights and mentorship not only elevated our projects but also empowered us to tackle every challenge with confidence and creativity."
                            },
                            "es": {
                                "info": "Desarrollador Principal en <b>GitHub</b>",
                                "text": "Tener a Mohana en nuestro equipo fue un activo invaluable. Sus profundas ideas sobre programación y su mentoría no solo elevaron nuestros proyectos, sino que también nos empoderaron para enfrentar cada desafío con confianza."
                            },
                            "te": {
                                "info": "<b>GitHub</b> వద్ద ప్రధాన డెవలపర్",
                                "text": "మోహన బృందంలో ఉండటం ఒక విలువైన సంపత్తి. అతని లోతైన ప్రోగ్రామింగ్ అవగాహన మరియు పాఠశాల అను మెంటారింగ్ మా ప్రాజెక్టులను మాత్రమే మెరుగుపరచలేదు, అదేవిధంగా ప్రతి సవాలును ధైర్యం మరియు సృజనాత్మకతతో ఎదుర్కొనడానికి మమ్మల్ని ప్రేరేపించాయి."
                            },
                            "hi": {
                                "info": "मुख्य डेवलपर <b>GitHub</b> पर",
                                "text": "हमारी टीम में मोहन होना एक अमूल्य संपत्ति थी। उनके गहरे प्रोग्रामिंग अंतर्दृष्टि और मार्गदर्शन ने न केवल हमारे प्रोजेक्ट को ऊंचा किया, बल्कि हमें हर चुनौती का सामना करने के लिए भी सशक्त बनाया।"
                            },
                            "sa": {
                                "info": "<b>GitHub</b> इत्यस्मिन् प्रमुख विकासकः",
                                "text": "मोहानः अस्माकं कार्यदलस्य अत्यन्तं मूल्यवानं सम्पत्ति। तस्य गहनं प्रोग्रामिङ्ग दृष्टिकोणं च मार्गदर्शनं च न केवलं अस्माकं प्रकल्पानां उन्नति साधयति, किन्तु प्रत्येकं चुनौतीं साहसं च सृजनात्मकतया अन्विष्यति।"
                            }
                        }
                    },
                    {
                        "value": "Paige Turner",
                        "links": [
                            {"href": null}
                        ],
                        "icon": {
                            "img": "images/pictures/person-2.png",
                            "fa": null,
                            "faColors": {"bg": null, "fill": null}
                        },
                        "locales": {
                            "en": {
                                "info": "Managing Director at <b>Dingga</b>",
                                "text": "Collaborating with Mohana was a game changer for our development process. His expertise and problem-solving abilities were invaluable to our success."
                            },
                            "es": {
                                "info": "Directora General en <b>Dingga</b>",
                                "text": "Colaborar con Mohana fue un cambio de juego para nuestro proceso de desarrollo. Su experiencia y habilidades para resolver problemas fueron invaluables para nuestro éxito."
                            },
                            "te": {
                                "info": "<b>Dingga</b> వద్ద నిర్వహణా దర్శకుడు",
                                "text": "మోహనతో కలిసి పని చేయడం మా అభివృద్ధి ప్రక్రియకు గేమ్ చేంజర్‌గా ఉండింది. అతని నైపుణ్యం మరియు సమస్యల పరిష్కార సామర్థ్యం మా విజయానికి ఎంతో విలువైనవి."
                            },
                            "hi": {
                                "info": "प्रबंध निदेशक <b>Dingga</b> पर",
                                "text": "मोहन के साथ सहयोग करना हमारे विकास प्रक्रिया के लिए एक गेम चेंजर था। उनकी विशेषज्ञता और समस्या-समाधान क्षमताएँ हमारी सफलता के लिए अमूल्य थीं।"
                            },
                            "sa": {
                                "info": "<b>Dingga</b> मध्ये व्यवस्थापकीय निदेशकः",
                                "text": "मोहानस्मिन् सह सहयोगः अस्माकं विकासप्रक्रियायाः खेलपरिवर्तकः आसीत्। तस्य विशेषज्ञता च समस्या समाधान क्षमताः अस्माकं सफलतायाः अतीव मूल्यवानाः आसन्।"
                            }
                        }
                    },
                    {
                        "value": "Chris P. Bacon",
                        "links": [
                            {"href": "https://dribbble.com"}
                        ],
                        "icon": {
                            "img": "images/pictures/person-4.png",
                            "fa": null,
                            "faColors": {"bg": null, "fill": null}
                        },
                        "locales": {
                            "en": {
                                "info": "Creative Director at <b>Dribbble</b>",
                                "text": "Mohana's attention to detail and innovative thinking brought a fresh perspective to our design process. He truly elevated our team's work and helped us deliver results beyond expectations."
                            },
                            "es": {
                                "info": "Directora Creativa en <b>Dribbble</b>",
                                "text": "La atención al detalle de Mohana y su pensamiento innovador aportaron una nueva perspectiva a nuestro proceso de diseño. Realmente elevó el trabajo de nuestro equipo y nos ayudó a ofrecer resultados más allá de lo esperado."
                            },
                            "te": {
                                "info": "<b>Dribbble</b> వద్ద సృజనాత్మక దర్శకత్వం",
                                "text": "మోహన యొక్క దృష్టి ప్రతీదానికి మరియు సృజనాత్మక ఆలోచనలతో మా రూపకల్పన ప్రక్రియకు కొత్త దృక్పథం తీసుకొచ్చింది. అతను నిజంగా మా బృందం యొక్క పనిని పెంచాడు మరియు కాదన్నదానికంటే ఎక్కువ ఫలితాలు అందించడంలో సహాయపడాడు."
                            },
                            "hi": {
                                "info": "क्रिएटिव डायरेक्टर <b>Dribbble</b> पर",
                                "text": "मोहन का ध्यान विस्तार पर और उनके अभिनव विचारों ने हमारी डिज़ाइन प्रक्रिया में एक नया दृष्टिकोण लाया। उन्होंने सच में हमारी टीम के काम को ऊंचा किया और हमें अपेक्षाओं से परे परिणाम देने में मदद की।"
                            },
                            "sa": {
                                "info": "<b>Dribbble</b> मध्ये सृजनात्मक निदेशकः",
                                "text": "मोहानस्य सूक्ष्मतायाः प्रति ध्यानं च नवीन दृष्टिकोनं अस्माकं रचनाप्रक्रियायाम् आलोकं ददाति। सः वर्त्तमानं अस्माकं कार्यसंघस्य कार्यं उत्थापयति च अपेक्षातीतं परिणामं प्रदातुं साहाय्यं करोति।"
                            }
                        }
                    }
                ]
        },

        {
            "id": "interests",
            "component": "ArticleGrid",
            "config": {
                "format": "grid"
            },
            "locales": {
                "en": {"title": "Personal **interests**"},
                "es": { "title": "Intereses **personales**" },
                "te": { "title": "వ్యక్తిగత **ఆసక్తులు**" },
                "hi": { "title": "व्यक्तिगत **रुचियाँ**" },
                "sa": { "title": "व्यक्तिगत **आकाङ्क्षा**" }
            },
        
            "items": [
                {
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-guitar",
                        "faColors": null
                    },
                    "value": null,
                    "locales": {
                        "en": {
                            "title": "Playing guitar",
                            "info": "Exploring different genres and improving my skills."
                        },
                        "es": {
                            "title": "Tocar la guitarra",
                            "info": "Explorando diferentes géneros y mejorando mis habilidades."
                        },
                        "te": {
                            "title": "గిటార్ వాయించడం",
                            "info": "వివిధ శ్రేణులను అన్వేషిస్తూ మరియు నైపుణ్యాలను మెరుగుపరుస్తున్నాను."
                        },
                        "hi": {
                            "title": "गिटार बजाना",
                            "info": "विभिन्न शैलियों का अन्वेषण करना और अपने कौशल को सुधारना।"
                        },
                        "sa": {
                            "title": "वीणां वादनं",
                            "info": "विविधं शैलिं अन्वेषणं च कौशलं परिष्कृत्य अभ्यासं करोमि।"
                        }
                    }
                },
        
                {
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-video",
                        "faColors": null
                    },
                    "value": null,
                    "locales": {
                        "en": {
                            "title": "AI video editing",
                            "info": "Learning to use AI tools to enhance my videos."
                        },
                        "es": {
                            "title": "Edición de video con IA",
                            "info": "Aprendiendo a usar herramientas de IA para mejorar mis videos."
                        },
                        "te": {
                            "title": "AI వీడియో ఎడిటింగ్",
                            "info": "నా వీడియోలను మెరుగుపరచటానికి AI సాధనాలను ఉపయోగించడం నేర్చుకుంటున్నాను."
                        },
                        "hi": {
                            "title": "AI वीडियो संपादन",
                            "info": "मेरे वीडियो को बढ़ाने के लिए AI टूल का उपयोग करना सीख रहा हूँ।"
                        },
                        "sa": {
                            "title": "AI चलचित्र सम्पादनं",
                            "info": "मम चलचित्राणां परिष्करणाय AI साधनानि उपयुज्यते च ज्ञातुं शिक्षामि।"
                        }
                    }
                },
        
                {
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-paint-brush",
                        "faColors": null
                    },
                    "value": null,
                    "locales": {
                        "en": {
                            "title": "Illustration",
                            "info": "Practicing digital art and exploring new styles."
                        },
                        "es": {
                            "title": "Ilustración",
                            "info": "Practicando arte digital y explorando nuevos estilos."
                        },
                        "te": {
                            "title": "ఇలస్ట్రేషన్",
                            "info": "డిజిటల్ కళను అభ్యాసం చేస్తూ కొత్త శైలులను అన్వేషించటం."
                        },
                        "hi": {
                            "title": "चित्रण",
                            "info": "डिजिटल कला का अभ्यास करना और नए शैलियों का अन्वेषण करना।"
                        },
                        "sa": {
                            "title": "चित्रण",
                            "info": "डिजिटलीय कलेन अभ्यासं करोमि च नव-शैल्याः अन्वेषणं करोमि।"
                        }
                    }
                },
        
                {
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-chart-line",
                        "faColors": null
                    },
                    "value": null,
                    "locales": {
                        "en": {
                            "title": "Art",
                            "info": "Inspired by creativity and expression through various mediums."
                        },
                        "es": {
                            "title": "Arte",
                            "info": "Inspirado por la creatividad y la expresión en diversos medios."
                        },
                        "te": {
                            "title": "కళ",
                            "info": "వివిధ మధ్యమాల ద్వారా సృజనాత్మకత మరియు వ్యక్తీకరణతో ప్రేరణ పొందడం."
                        },
                        "hi": {
                            "title": "कला",
                            "info": "विभिन्न माध्यमों के माध्यम से रचनात्मकता और अभिव्यक्ति से प्रेरित।"
                        },
                        "sa": {
                            "title": "कला",
                            "info": "विभिन्न माध्यमैः सृजनात्मकता च व्यक्तित्वं प्रेरितम्।"
                        }
                    }
                },
        
                {
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-pencil-alt",
                        "faColors": null
                    },
                    "value": null,
                    "locales": {
                        "en": {
                            "title": "Data Engineering",
                            "info": "Specializing in scalable data solutions, ETL optimization, and advanced analytics on cloud platforms."
                        },
                        "es": {
                            "title": "Ingeniería de Datos",
                            "info": "Especializado en soluciones de datos escalables, optimización de ETL y análisis avanzados en plataformas en la nube."
                        },
                        "te": {
                            "title": "డేటా ఇంజనీరింగ్",
                            "info": "స్కేలబుల్ డేటా పరిష్కారాలు, ETL ఆప్టిమైజేషన్, మరియు క్లౌడ్ ప్లాట్‌ఫామ్‌లపై అధునాతన విశ్లేషణలో ప్రత్యేకత."
                        },
                        "hi": {
                            "title": "डेटा इंजीनियरिंग",
                            "info": "स्केलेबल डेटा समाधान, ETL अनुकूलन, और क्लाउड प्लेटफार्मों पर उन्नत विश्लेषण में विशेषज्ञता।"
                        },
                        "sa": {
                            "title": "दत्तानिर्माणम्",
                            "info": "स्केलेबल् दत्ताप्रणालीनां समाधानं च ETL सम्पादनं च क्लाउडप्लेटफार्मेषु उन्नतं विवेचनं च विशेषज्ञता।"
                        }
                    }
                },
        
                {
                    "icon": {
                        "img": null,
                        "fa": "fa-solid fa-camera-retro",
                        "faColors": null
                    },
                    "value": null,
                    "locales": {
                        "en": {
                            "title": "Nature Adventures",
                            "info": "Passionate about exploring nature through hiking, camping, and outdoor activities."
                        },
                        "es": {
                            "title": "Aventuras en la Naturaleza",
                            "info": "Apasionado por explorar la naturaleza a través del senderismo y el campamento."
                        },
                        "te": {
                            "title": "ప్రకృతి అడ్వెంచర్స్",
                            "info": "హైకింగ్, కాంపింగ్ మరియు బయో ఆసక్తుల ద్వారా ప్రకృతిని అన్వేషించడంలో ఆసక్తిగా ఉన్నాను."
                        },
                        "hi": {
                            "title": "प्रकृति की रोमांच",
                            "info": "हाइकिंग, कैम्पिंग और बाहरी गतिविधियों के माध्यम से प्रकृति का अन्वेषण करने के प्रति उत्साही।"
                        },
                        "sa": {
                            "title": "प्रकृतिविषये साहसिकाणि",
                            "info": "सर्वेक्षणाय पर्वतारोहणम्, शिबीरं च कर्तुं प्राणिमत्तः च आवगन्तुं इच्छामि।"
                        }
                    }
                }
            ]
        }            
    ]
}
